#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/edenmind/openarabic/runs/run-QVkwNgnNcfNGw7vj

Waiting for the plan to start...

Terraform v1.2.1
on linux_amd64
Initializing plugins and modules...
data.digitalocean_kubernetes_cluster.openarabic: Reading...
digitalocean_kubernetes_cluster.openarabic: Refreshing state... [id=a4393850-71dd-4c50-a1c2-08af9013e1b1]
data.digitalocean_kubernetes_cluster.openarabic: Read complete after 0s [id=a4393850-71dd-4c50-a1c2-08af9013e1b1]
helm_release.istio-istiod: Refreshing state... [id=istio-istiod]
helm_release.istio-base: Refreshing state... [id=istio-base]
helm_release.istio-ingress: Refreshing state... [id=istio-ingress]
helm_release.prometheus-stack: Refreshing state... [id=prometheus-stack]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_namespace.gateway will be created
  + resource "kubernetes_namespace" "gateway" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "istio-injection" = "enabled"
            }
          + name             = "gateway"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @YunusAndreasson, Action: `pull_request`*